#基本format格式化方法
s="{}那么大，{}想去看看".format("世界","我")
print(s)
#---------------------------------------
# 1.占位符为：-
#2. 从右边开始填写数值
# 3.加上数值和占位符一共20个位置
#4. print('{:0>2} {i}'.format(i + 1))#format函数不能在{}里面写入变量，这个写法是错误的，变量只能在参数位置
#5.{：.2f}保留小数

s="我吃了{:->20}个鸡腿".format(3)
print(s)#我吃了-------------------3个鸡腿
#也可以用3来占位
# --------------------------------------
# 加上千位分割符号
s="我吃了{:->20,}个鸡腿".format(1314)
print(s)#我吃了---------------1,314个鸡腿
# -------------------------------------------
#保留小数
s="我吃了{:.2f}个鸡腿".format(3.1415)
print(s)#我吃了3.14个鸡腿
# print('{:0>2} {i}'.format(i + 1))#format函数不能在{}里面写入变量，这个写法是错误的，变量只能在参数位置
#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++=
#题目输入23，42，543，56，71。输出       23，    42，         543，     56，     71
mun=input().split("，")
for i in mun:
    print("{:>10}".format(i),end="")#end=""，将python的自动换行改为空
#-----------------------------------------------------------------
#第二题
n=input("")
for i in range(int(n)):
    print('{:0>2} {}'.format(i+1, '>'*(i+1)))#这题两个占位符，因为format后面两个参数#format后面填本体,本体能操作就本体操作
    # print('{:0>2} {i}'.format(i + 1))#format函数不能在{}里面写入变量，这个写法是错误的，变量只能在参数位置

